# **Py City Schools Data Analysis Observations:**

* Charter schools have outperformed the public schools. All top five performing schools by % overall passing rate are charter schools, while bottom five performing five schools re public schools. 
* Charter school has spent less money (range: \\$578-\\$638) to educate a student (per student budget) compared to public school which has spent higher money (range: \\$637-\\$655) to educate a student (per student budget).
* Overall school performance is directly liked to spending. Lower spending per student **(\<$585) yielded better school performance compared to higher (\\$645-\\$675)** spending per student.  
* School size performance impact: Large schools (2000-5000) performance is significantly lower across the board (math, reading and overall score) compared to medium and small schools.*This could be a result of student/teach ratio, teaching facilities availability per students etc. This information is not provided in the provided data.*

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import os

# Prepare data file locations
school_data_to_load= os.path.join("Resources","schools_complete.csv")
student_data_to_load= os.path.join("Resources","students_complete.csv")

# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

## District Summary

* Calculate the total number of schools

* Calculate the total number of students

* Calculate the total budget

* Calculate the average math score 

* Calculate the average reading score

* Calculate the overall passing rate (overall average score), i.e. (avg. math score + avg. reading score)/2

* Calculate the percentage of students with a passing math score (70 or greater)

* Calculate the percentage of students with a passing reading score (70 or greater)

* Create a dataframe to hold the above results

* Optional: give the displayed data cleaner formatting

In [2]:
#Calculate the total number of schools
number_of_schools= school_data_complete["school_name"].nunique()
number_of_schools

15

In [3]:
#Calculate the total number of schools
number_of_students= "{:,}".format(school_data_complete["Student ID"].nunique())
number_of_students

'39,170'

In [4]:
#Calculate the total budget for district
total_budget="${:,}".format(school_data["budget"].sum())
total_budget

'$24,649,428'

In [5]:
#Calcluate average math score
average_math_score = school_data_complete["math_score"].mean()
average_math_score

78.98537145774827

In [6]:
#Calculate the average reading score
average_reading_score = school_data_complete["reading_score"].mean()
average_reading_score

81.87784018381414

In [7]:
#Calculate the overall passing rate (overall average score), i.e. (avg. math score + avg. reading score)/2
overall_passing_Rate = (float(average_math_score) + float(average_reading_score))/2
overall_passing_Rate

80.43160582078121

In [8]:
#Calculate the percentage of students with a passing math score (70 or greater)
school_data_complete["students_math_gt70"]= school_data_complete["math_score"]>=70
student_math_gt70_score=((school_data_complete["students_math_gt70"]).mean())*100
student_math_gt70_score

74.9808526933878

In [9]:
#Calculate the percentage of students with a passing reading score (70 or greater)
school_data_complete["students_reading_gt70"]=school_data_complete["reading_score"]>=70
students_reading_gt70_score = ((school_data_complete["students_reading_gt70"]).mean())*100
students_reading_gt70_score

85.80546336482001

In [10]:
#Optional: give the displayed data cleaner formatting - this is already done as value was calculated

In [11]:
#Create a dataframe to hold the above results

#Build header list
header_list =["Total Schools","Total Students","Total Budget","Average Math Score","Average Reading Score","% Passing Math","% Passing Reading","% Overall Passing Rate"]

#Build value list
value_list=[number_of_schools,number_of_students,total_budget,average_math_score,average_reading_score,student_math_gt70_score,students_reading_gt70_score,overall_passing_Rate]

#Zip the 2 lists together into one list of (key,value) 
zipped_key_value = list(zip(header_list,value_list))

#Build a dictionary with the zipped list 
summary_data = dict(zipped_key_value)

#Build district summary table
dist_summary = pd.DataFrame([summary_data])

#Display district summary table
dist_summary.head()

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,"39,170","$24,649,428",78.985371,81.87784,74.980853,85.805463,80.431606

* Create an overview table that summarizes key metrics about each school, including:
  * School Name
  * School Type
  * Total Students
  * Total School Budget
  * Per Student Budget
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)
  
* Create a dataframe to hold the above results

In [12]:
#lets make copy of school data so we can look back orginal data
school_level_score=school_data_complete

In [13]:
#Add passing score to school_level_score
school_level_score["math_70"] = school_data_complete["math_score"]>=70
school_level_score["reading_70"] = school_data_complete["reading_score"]>=70

In [14]:
#Check for data sanity - 70+ math and reading scores are added to data frame
school_level_score.head(2)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget,students_math_gt70,students_reading_gt70,math_70,reading_70
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635,True,False,True,False
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635,False,True,False,True

In [15]:
#Passing- math,reading and overall will be caluclated andded in later stage -once we get math_70 and reading_70 scores.

In [16]:
#Group by school name and school type to get school level data: student count, average math and reading scores, total budget
school_level_score=school_level_score.groupby(["school_name","type"]).mean()

#Check for data sanity -average scores are computed
school_level_score.head(2)

,,Student ID,reading_score,math_score,School ID,size,budget,students_math_gt70,students_reading_gt70,math_70,reading_70
school_name,type,,,,,,,,,,
Bailey High School,District,20358.5,81.033963,77.048432,7.0,4976.0,3124928.0,0.666801,0.819333,0.666801,0.819333
Cabrera High School,Charter,16941.5,83.975780,83.061895,6.0,1858.0,1081356.0,0.941335,0.970398,0.941335,0.970398

In [17]:
##NOTE: Column names will be renamed once all required columns are added.

#calculate passing-math,reading - need to make it %
school_level_score["math_70"]=school_level_score["math_70"]*100
school_level_score["reading_70"]=school_level_score["reading_70"]*100

#calculate overall passing rate
school_level_score["overall_70_average"]=(school_level_score["math_70"]+school_level_score["reading_70"])/2

#budget per student (size is sum of students for that school)
school_level_score["budget_student"]=school_level_score["budget"]/school_level_score["size"]

In [18]:
#Drop Student ID and School ID as these two keys will be irrelvant
school_level_score=school_level_score.drop(["Student ID","School ID"], axis=1)

In [19]:
#Check for data sanity- Student ID and School ID are removed from the data frame 
school_level_score.head(2)

,,reading_score,math_score,size,budget,students_math_gt70,students_reading_gt70,math_70,reading_70,overall_70_average,budget_student
school_name,type,,,,,,,,,,
Bailey High School,District,81.033963,77.048432,4976.0,3124928.0,0.666801,0.819333,66.680064,81.933280,74.306672,628.0
Cabrera High School,Charter,83.975780,83.061895,1858.0,1081356.0,0.941335,0.970398,94.133477,97.039828,95.586652,582.0

In [20]:
#Sort the data by Overall passing score (overall_70_average) 
school_level_score.sort_values(by="overall_70_average", inplace=True, ascending=False)

In [21]:
#Format data elements - Student ID, Total School Budget and Per Student Budget
school_level_score["size"]=school_level_score["size"].astype(int)
school_level_score["budget"]=(school_level_score["budget"]).astype(float).apply('${:,.2f}'.format)
school_level_score["budget_student"]=(school_level_score["budget_student"]).astype(float).apply('${:,.2f}'.format)

In [22]:
#Reset indexs to enable indexing column renaming to School Name and Type
school_level_score=school_level_score.reset_index()

In [23]:
#Check for data sanity - confirm indexes are dropped
school_level_score.head(2)

,school_name,type,reading_score,math_score,size,budget,students_math_gt70,students_reading_gt70,math_70,reading_70,overall_70_average,budget_student
0,Cabrera High School,Charter,83.97578,83.061895,1858,"$1,081,356.00",0.941335,0.970398,94.133477,97.039828,95.586652,$582.00
1,Thomas High School,Charter,83.84893,83.418349,1635,"$1,043,130.00",0.932722,0.973089,93.272171,97.308869,95.290520,$638.00

In [24]:
#rename columns and reorder the position of columns
school_level_score.rename(columns={"school_name":"School Name",
                                   "type":"School Type",
                                   "size":"Total Students",
                                   "budget":"Total School Budget",
                                   "budget_student":"Per Student Budget",
                                   "math_score":"Average Math Score",
                                   "reading_score":"Average Reading Score",
                                   "math_70":"% Passing Math",
                                   "reading_70":"% Passing Reading",
                                   "overall_70_average":"% Overall Passing Rate"}, inplace=True)

In [25]:
#Check data frame columns - renames are reflected as expected
school_level_score.columns

Index(['School Name', 'School Type', 'Average Reading Score',
       'Average Math Score', 'Total Students', 'Total School Budget',
       'students_math_gt70', 'students_reading_gt70', '% Passing Math',
       '% Passing Reading', '% Overall Passing Rate', 'Per Student Budget'],
      dtype='object')

In [26]:
#Reorder columns
school_level_score=school_level_score[["School Name","School Type","Total Students","Total School Budget","Per Student Budget","Average Math Score",
                                       "Average Reading Score","% Passing Math","% Passing Reading","% Overall Passing Rate"]]

In [27]:
#Data sanity check- confirm colums are repordered as expected
school_level_score.head(10)

,School Name,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,95.586652
1,Thomas High School,Charter,1635,"$1,043,130.00",$638.00,83.418349,83.848930,93.272171,97.308869,95.290520
2,Pena High School,Charter,962,"$585,858.00",$609.00,83.839917,84.044699,94.594595,95.945946,95.270270
3,Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,95.265668
4,Wilson High School,Charter,2283,"$1,319,574.00",$578.00,83.274201,83.989488,93.867718,96.539641,95.203679
5,Wright High School,Charter,1800,"$1,049,400.00",$583.00,83.682222,83.955000,93.333333,96.611111,94.972222
6,Shelton High School,Charter,1761,"$1,056,600.00",$600.00,83.359455,83.725724,93.867121,95.854628,94.860875
7,Holden High School,Charter,427,"$248,087.00",$581.00,83.803279,83.814988,92.505855,96.252927,94.379391
8,Bailey High School,District,4976,"$3,124,928.00",$628.00,77.048432,81.033963,66.680064,81.933280,74.306672
9,Hernandez High School,District,4635,"$3,022,020.00",$652.00,77.289752,80.934412,66.752967,80.862999,73.807983

In [28]:
# End of data frame preparation for second part

## School Summary

## Top Performing Schools (By Passing Rate)

* Sort and display the top five schools in overall passing rate

In [29]:
#Below formatting is not required and purely done to match expected output
school_level_score.rename(columns={"School Name":""}, inplace=True)
school_level_score = school_level_score.set_index([''])

In [30]:
#Top five performning schools- data is already sorted in earlier step
school_level_score.head(5)

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
,,,,,,,,,
Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,95.586652
Thomas High School,Charter,1635,"$1,043,130.00",$638.00,83.418349,83.848930,93.272171,97.308869,95.290520
Pena High School,Charter,962,"$585,858.00",$609.00,83.839917,84.044699,94.594595,95.945946,95.270270
Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,95.265668
Wilson High School,Charter,2283,"$1,319,574.00",$578.00,83.274201,83.989488,93.867718,96.539641,95.203679

## Bottom Performing Schools (By Passing Rate)

* Sort and display the five worst-performing schools

In [31]:
#Bottom performning schools-Copy data to another data frame to sort bottom 5
bottom_perform_data =school_level_score.tail(5)

In [32]:
#Sort data frame created for bottom performing schools
bottom_perform_data.sort_values(by="% Overall Passing Rate", inplace=True, ascending=True)

C:\Users\anuaj\Anaconda3\envs\PythonData2020_1\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [33]:
#Show result of bottom perfornming schools
bottom_perform_data

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
,,,,,,,,,
Rodriguez High School,District,3999,"$2,547,363.00",$637.00,76.842711,80.744686,66.366592,80.220055,73.293323
Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,73.363852
Huang High School,District,2917,"$1,910,635.00",$655.00,76.629414,81.182722,65.683922,81.316421,73.500171
Johnson High School,District,4761,"$3,094,650.00",$650.00,77.072464,80.966394,66.057551,81.222432,73.639992
Ford High School,District,2739,"$1,763,916.00",$644.00,77.102592,80.746258,68.309602,79.299014,73.804308

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

In [34]:
#There are multiple ways to approach this- for math scores, I will use long route to practice other areas 
# and for reading scores will use gropup by the way it was used in part 2

In [35]:
#Math Scores by Grade - student_data frame is used
student_data.head(2)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61

In [36]:
#Copy student data to student_math_grp data frame (with reuired columns)
student_math_grp = student_data[["school_name","grade","math_score"]]

In [37]:
#Group by School and Grade to get average scores for each school and grade
student_math_grp=student_math_grp.groupby(["school_name","grade"]).mean()

In [38]:
#Reset index created because of group by clause
student_math_grp = student_math_grp.reset_index()

In [39]:
#Check for results 
student_math_grp.head(3)

          school_name grade  math_score
0  Bailey High School  10th   76.996772
1  Bailey High School  11th   77.515588
2  Bailey High School  12th   76.492218

In [40]:
#Create School name as Index so we can build series
student_math_grp = student_math_grp.set_index(['school_name'])

In [41]:
#Create 9th grade series with a condition grade=9th and math score is >0
nine_grade_math = student_math_grp[(student_math_grp['grade'] == "9th") & (student_math_grp['math_score'] >0) ]
nine_grade_math["math_score"].head(2)

school_name
Bailey High School     77.083676
Cabrera High School    83.094697
Name: math_score, dtype: float64

In [42]:
#Create 10th grade series with a condition grade=10th and math score is >0
ten_grade_math = student_math_grp[(student_math_grp['grade'] == "10th") & (student_math_grp['math_score'] >0) ]
ten_grade_math["math_score"].head(2)

school_name
Bailey High School     76.996772
Cabrera High School    83.154506
Name: math_score, dtype: float64

In [43]:
#Create 11th grade series with a condition grade=11th and math score is >0
eleven_grade_math = student_math_grp[(student_math_grp['grade'] == "11th") & (student_math_grp['math_score'] >0) ]
eleven_grade_math["math_score"].head(2)

school_name
Bailey High School     77.515588
Cabrera High School    82.765560
Name: math_score, dtype: float64

In [44]:
#Create 12th grade series with a condition grade=12th and math score is >0
twelve_grade_math = student_math_grp[(student_math_grp['grade'] == "12th") & (student_math_grp['math_score'] >0) ]
twelve_grade_math["math_score"].head(2)

school_name
Bailey High School     76.492218
Cabrera High School    83.277487
Name: math_score, dtype: float64

In [45]:
#Concanate all these 4 series
student_math_grp= pd.concat([nine_grade_math,ten_grade_math,eleven_grade_math,twelve_grade_math] , axis=1)

In [46]:
#Display partial result-sanity check to see series are added
student_math_grp.head(5)

,grade,math_score,grade,math_score,grade,math_score,grade,math_score
school_name,,,,,,,,
Bailey High School,9th,77.083676,10th,76.996772,11th,77.515588,12th,76.492218
Cabrera High School,9th,83.094697,10th,83.154506,11th,82.765560,12th,83.277487
Figueroa High School,9th,76.403037,10th,76.539974,11th,76.884344,12th,77.151369
Ford High School,9th,77.361345,10th,77.672316,11th,76.918058,12th,76.179963
Griffin High School,9th,82.044010,10th,84.229064,11th,83.842105,12th,83.356164

In [47]:
#Get column names so they can be renamed and irrelvant columns are dropped
student_math_grp.columns

Index(['grade', 'math_score', 'grade', 'math_score', 'grade', 'math_score',
       'grade', 'math_score'],
      dtype='object')

In [48]:
#Rename columns - position based because there are duplicate columns
student_math_grp.columns=["grade","9th","grade1","10th","grade2","11th","grade3","12th"]

In [49]:
#Remove unwanted columns
student_math_grp=student_math_grp.drop(['grade', 'grade1', 'grade2','grade3'], axis=1)

In [50]:
#Display result
student_math_grp.head(2)

                           9th       10th       11th       12th
school_name
Bailey High School   77.083676  76.996772  77.515588  76.492218
Cabrera High School  83.094697  83.154506  82.765560  83.277487

In [51]:
#Reset index - we can rename the column
student_math_grp = student_math_grp.reset_index()

In [52]:
#Not required - this is done just to align expected result
student_math_grp.rename(columns={"school_name":""}, inplace=True)
student_math_grp = student_math_grp.set_index([''])

In [53]:
#Display results - all rows
student_math_grp

                             9th       10th       11th       12th

Bailey High School     77.083676  76.996772  77.515588  76.492218
Cabrera High School    83.094697  83.154506  82.765560  83.277487
Figueroa High School   76.403037  76.539974  76.884344  77.151369
Ford High School       77.361345  77.672316  76.918058  76.179963
Griffin High School    82.044010  84.229064  83.842105  83.356164
Hernandez High School  77.438495  77.337408  77.136029  77.186567
Holden High School     83.787402  83.429825  85.000000  82.855422
Huang High School      77.027251  75.908735  76.446602  77.225641
Johnson High School    77.187857  76.691117  77.491653  76.863248
Pena High School       83.625455  83.372000  84.328125  84.121547
Rodriguez High School  76.859966  76.612500  76.395626  77.690748
Shelton High School    83.420755  82.917411  83.383495  83.778976
Thomas High School     83.590022  83.087886  83.498795  83.497041
Wilson High School     83.085578  83.724422  83.195326  83.035794
Wright High School     83.264706  84.010288  83.836782  83.644986

## Reading Score by Grade

* Perform the same operations as above for reading scores

In [54]:
#Reading Scores by Grade
student_data.head(2)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61

In [55]:
#Get reading scores - straight with group by
nine_grade_reading = student_data[student_data["grade"]=="9th"].groupby(["school_name"]).mean()["reading_score"]
ten_grade_reading = student_data[student_data["grade"]=="10th"].groupby(["school_name"]).mean()["reading_score"]
eleven_grade_reading = student_data[student_data["grade"]=="11th"].groupby(["school_name"]).mean()["reading_score"]
twelve_grade_reading = student_data[student_data["grade"]=="12th"].groupby(["school_name"]).mean()["reading_score"]

In [56]:
#Build dataframe
student_reading_grp = pd.DataFrame({"9th":nine_grade_reading,"10th":ten_grade_reading,
                                    "11th":eleven_grade_reading,"12th":twelve_grade_reading
                                    
})

In [57]:
#Sanity check - check the reading data frame
student_reading_grp.head(2)

                           9th       10th       11th       12th
school_name
Bailey High School   81.303155  80.907183  80.945643  80.912451
Cabrera High School  83.676136  84.253219  83.788382  84.287958

In [58]:
#Reset Index and update it to blank to mimic result - Not a required step
student_reading_grp = student_reading_grp.reset_index()

In [59]:
#Update school name to ""
student_reading_grp.rename(columns={"school_name":""}, inplace=True)

In [60]:
#Set index back to blacnk
student_reading_grp = student_reading_grp.set_index([''])

In [61]:
#Display results
student_reading_grp

                             9th       10th       11th       12th

Bailey High School     81.303155  80.907183  80.945643  80.912451
Cabrera High School    83.676136  84.253219  83.788382  84.287958
Figueroa High School   81.198598  81.408912  80.640339  81.384863
Ford High School       80.632653  81.262712  80.403642  80.662338
Griffin High School    83.369193  83.706897  84.288089  84.013699
Hernandez High School  80.866860  80.660147  81.396140  80.857143
Holden High School     83.677165  83.324561  83.815534  84.698795
Huang High School      81.290284  81.512386  81.417476  80.305983
Johnson High School    81.260714  80.773431  80.616027  81.227564
Pena High School       83.807273  83.612000  84.335938  84.591160
Rodriguez High School  80.993127  80.629808  80.864811  80.376426
Shelton High School    84.122642  83.441964  84.373786  82.781671
Thomas High School     83.728850  84.254157  83.585542  83.831361
Wilson High School     83.939778  84.021452  83.764608  84.317673
Wright High School     83.833333  83.812757  84.156322  84.073171

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

In [62]:
#Use exisiting data frame - check columns
school_level_score.columns

Index(['School Type', 'Total Students', 'Total School Budget',
       'Per Student Budget', 'Average Math Score', 'Average Reading Score',
       '% Passing Math', '% Passing Reading', '% Overall Passing Rate'],
      dtype='object')

In [63]:
#Copy data frame to school spending score 
school_spending_score =school_level_score

In [64]:
#Reset data frame index
school_spending_score =school_spending_score.reset_index()

In [65]:
#Get relevant columns (refer above column list)
school_spending_score = school_level_score[['Per Student Budget', 'Average Math Score', 'Average Reading Score','% Passing Math', '% Passing Reading', '% Overall Passing Rate']]

In [66]:
#Check new data set to verify columns
school_spending_score.head(2)

,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
,,,,,,
Cabrera High School,$582.00,83.061895,83.97578,94.133477,97.039828,95.586652
Thomas High School,$638.00,83.418349,83.84893,93.272171,97.308869,95.290520

In [67]:
#Check data types of columns
school_spending_score.dtypes

Per Student Budget         object
Average Math Score        float64
Average Reading Score     float64
% Passing Math            float64
% Passing Reading         float64
% Overall Passing Rate    float64
dtype: object

In [68]:
#Conver Per Student Budget to float as it will be used in binning
school_spending_score["Per Student Budget"]=school_spending_score["Per Student Budget"].str.replace("$","").astype(float)

C:\Users\anuaj\Anaconda3\envs\PythonData2020_1\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [69]:
#Set bins and bin groups
spending_bins = [0, 585, 615, 645, 675]
group_names = ["<$585", "$585-615", "$615-645", "$645-675"]

In [70]:
#Apply bins on Spending per student
school_spending_score['Spending Ranges (Per Student)'] = pd.cut(school_spending_score['Per Student Budget'], spending_bins, labels=group_names)

C:\Users\anuaj\Anaconda3\envs\PythonData2020_1\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [71]:
#Select required columns 
school_spending_score=school_spending_score[['Spending Ranges (Per Student)','Average Math Score', 'Average Reading Score','% Passing Math', '% Passing Reading', '% Overall Passing Rate']]

In [72]:
school_spending_score.head(2)

,Spending Ranges (Per Student),Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
,,,,,,
Cabrera High School,<$585,83.061895,83.97578,94.133477,97.039828,95.586652
Thomas High School,$615-645,83.418349,83.84893,93.272171,97.308869,95.290520

In [73]:
# Sort by Spending Ranges
school_spending_score.sort_values(by="Spending Ranges (Per Student)", inplace=True, ascending=True)

In [74]:
#Group by Spending Ranges
school_spending_score=school_spending_score.groupby(["Spending Ranges (Per Student)"]).mean()

In [75]:
#Display the results
school_spending_score

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
Spending Ranges (Per Student),,,,,
<$585,83.455399,83.933814,93.460096,96.610877,95.035486
$585-615,83.599686,83.885211,94.230858,95.900287,95.065572
$615-645,79.079225,81.891436,75.668212,86.106569,80.887391
$645-675,76.997210,81.027843,66.164813,81.133951,73.649382

## Scores by School Size

* Perform the same operations as above, based on school size.

In [76]:
#Make copy of school level score data frame
school_size_score =school_level_score

In [77]:
#Reset Index values
school_size_score=school_size_score.reset_index()

In [78]:
#Select only required data columns from data frame
school_size_score=school_size_score[["Total Students","Average Math Score","Average Reading Score","% Passing Math","% Passing Reading","% Overall Passing Rate"]]

In [79]:
#Check data frame columns to see if we have all what is needed 
school_size_score.head(2)

,Total Students,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,1858,83.061895,83.97578,94.133477,97.039828,95.586652
1,1635,83.418349,83.84893,93.272171,97.308869,95.290520

In [80]:
# Set bins and groups
size_bins = [0, 1000, 2000, 5000]
group_names = ["Small (<1000)", "Medium (1000-2000)", "Large (2000-5000)"]

In [81]:
#Apply bins and groups to get School size
school_size_score['School Size'] = pd.cut(school_size_score['Total Students'], size_bins, labels=group_names)

In [82]:
#Drop Total student /size columns
school_size_score =school_size_score.drop(['Total Students'], axis=1)

In [83]:
#Group by on school size 
school_size_score=school_size_score.groupby(["School Size"]).mean()

In [84]:
#Display results
school_size_score

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
School Size,,,,,
Small (<1000),83.821598,83.929843,93.550225,96.099437,94.824831
Medium (1000-2000),83.374684,83.864438,93.599695,96.790680,95.195187
Large (2000-5000),77.746417,81.344493,69.963361,82.766634,76.364998

## Scores by School Type

* Perform the same operations as above, based on school type.

In [85]:
#Make copy of existing data frame
school_type_score =school_level_score

In [86]:
#Drop Total student column as it is not required
school_type_score=school_type_score.drop(["Total Students","Total School Budget","Per Student Budget"], axis=1)

In [87]:
#As there are only two school types - Charter and District and these values are string - binning cannot be applied.
#Simple group by will give the results
school_type_score = school_type_score.groupby("School Type").mean()

In [88]:
#Display results
school_type_score

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
School Type,,,,,
Charter,83.473852,83.896421,93.620830,96.586489,95.103660
District,76.956733,80.966636,66.548453,80.799062,73.673757

In [89]:
#End of Analysis